projetoHRO/app/controllers/pops_controller.rb

SELECT "pops".* FROM "pops"
---
  def index
    @pops = Pop.all

INSERT INTO "pops" ("titulo", "objetivo", "amostra", "equipamento", "material", "calibracao", "controleQualidade", "aplicabilidade", "descricao", "calculos", "resultados", "comentarios", "responsabilidade", "autoridade", "normasSeguranca", "treinamento", "documentosRelacionados", "referenciasNormativas", "fluxograma", "controleRegistro", "anexos", "elaborado1", "elaborado2", "revisado", "formatado", "validado1", "validado2", "aprovado", "day_approval", "month_approval", "year_approval", "day_implement", "year_implement", "month_implement", "pop_sector", "pop_number", "corenE1", "corenE2", "corenR1", "corenF1", "corenV1", "corenV2", "corenA1", "functionE1", "functionE2", "functionR1", "functionF1", "functionV1", "functionV2", "functionA1", "date_day_elaboration", "date_month_elaboration", "date_year_elaboration", "date_day_last_revision", "date_month_last_revision", "date_year_last_revision", "date_day_next_revision", "date_month_next_revision", "date_year_next_revision", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @pop = Pop.new(pop_params)

    respond_to do |format|
      if @pop.save

UPDATE "pops" SET "titulo" = ?, "objetivo" = ?, "amostra" = ?, "equipamento" = ?, "material" = ?, "calibracao" = ?, "controleQualidade" = ?, "aplicabilidade" = ?, "descricao" = ?, "calculos" = ?, "resultados" = ?, "comentarios" = ?, "responsabilidade" = ?, "autoridade" = ?, "normasSeguranca" = ?, "treinamento" = ?, "documentosRelacionados" = ?, "referenciasNormativas" = ?, "fluxograma" = ?, "controleRegistro" = ?, "anexos" = ?, "elaborado1" = ?, "elaborado2" = ?, "revisado" = ?, "formatado" = ?, "validado1" = ?, "validado2" = ?, "aprovado" = ?, "day_approval" = ?, "month_approval" = ?, "year_approval" = ?, "day_implement" = ?, "month_implement" = ?, "year_implement" = ?, "pop_sector" = ?, "pop_number" = ?, "corenE1" = ?, "corenE2" = ?, "corenR1" = ?, "corenF1" = ?, "corenV1" = ?, "corenV2" = ?, "corenA1" = ?, "functionE1" = ?, "functionE2" = ?, "functionR1" = ?, "functionF1" = ?, "functionV1" = ?, "functionV2" = ?, "functionA1" = ?, "date_day_elaboration" = ?, "date_month_elaboration" = ?, "date_year_elaboration" = ?, "date_day_last_revision" = ?, "date_month_last_revision" = ?, "date_year_last_revision" = ?, "date_day_next_revision" = ?, "date_month_next_revision" = ?, "date_year_next_revision" = ?, "updated_at" = ? WHERE "pops"."id" = ?
---
  def update
    respond_to do |format|
      if @pop.update(pop_params)

DELETE FROM "pops" WHERE "pops"."id" = ?  [["id", 10]]
---
  def destroy
    @pop.destroy

SELECT "pops".* FROM "pops" WHERE "pops"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_pop
      @pop = Pop.find(params[:id])