projetoHRO/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "city", "state", "sector", "password", "passwordConfirm", "image", "coren", "phone", "district", "street", "address_complement", "function", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "street" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["street", "Rua da Esquina"], ["updated_at", "2023-08-16 20:29:34.626869"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)